#Предполагается что у всех операторов 100% покрытие то есть не проверяется может ли оператор оказать услугу в России в конкретном регионе
#Мегафон, тарифы Все включено L and VIP - включенные в тариф объемы смс и ммс считаются по отдельности, то есть объем включеных в два раза больше
#Стоимость перехода с одного тарифа на другой не учитывается
#Тарификация Крыма специально не выделяется (должно скоро поменяться)
#Ограничения на доступный интернет в некоторых регионах не учитываются (предполагается что везде есть), будет исправлено
#Опции включенные при подключении тарифа, которые можно отключить и которые не бесплатные в расчет тарифов не берутся
#Любимых номеров (Мегафон опция, Билайн - тариф "мобильный пенсионер") пока нет
#Билайн, тариф "Первый детский*" не учитывается так как его преимущества тяжело учесть
