#Предполагается что у всех операторов 100% покрытие то есть не проверяется может ли оператор оказать услугу в России в конкретном регионе
#Мегафон, тарифы Все включено L and VIP - включенные в тариф объемы смс и ммс считаются по отдельности, то есть объем включеных в два раза больше
#Стоимость перехода с одного тарифа на другой не учитывается
#Тарифные опции которые не использовались не учитываются (в том числе при расчете фиксированного набора опций)
#Одноразовые платежи (за подключение) учитываются - предполагается что такие опции не выгодны на постоянной основе
#Тарификация Крыма специально не выделяется (должно скоро поменяться)
#Ограничения на доступный интернет в некоторых регионах не учитываются (предполагается что везде есть), будет исправлено
#Опции включенные при подключении тарифа, которые можно отключить и которые не бесплатные в расчет тарифов не берутся
#Любимых номеров (Мегафон опция, Билайн - тариф "мобильный пенсионер") пока нет
#Билайн, тариф "Первый детский*" не учитывается так как его преимущества тяжело учесть
#Билайн, Нет постоплатных тарифов серии "Все за" с городскими номерами (они дублируют тарифы с федеральными номерами)
#Билайн, нет опции "Моя Украина"
#Билайн, нет опций "Продли скорость 1 Гб и 3 Гб", "Интернет на всё" так как объем оплаченного интернета не меняется; "Безлимитный серфинг с Opera mini" - не могу отличать трафик
#Билайн, нет опции "Неделя интернет-роуминга" - пока. И опция "Самый выгодный интернет в роуминге" такая же почти во всех странах
#Билайн, опции "Хайвей 15 и 30 Гб" - ночной трафик не исключается как в опции

